<?php if ( ! defined( 'FW' ) ) {
	die( 'Forbidden' );
}

$options = array(
    'main' => array(
        'type'    => 'box',
        'title'   => '',
        'options' => array(
            'id'       => array(
                'type'  => 'unique',
            ),
            'builder'  => array(
                'type'    => 'tab',
                'title'   => __( 'Form Fields', 'fw' ),
                'options' => array(
                    'order-form-section-1' => array(
                        'type' => 'box',
                        'title' => __('Подача авто', '{domain}'),
                        'options' => array(
                            'place' => array(
                                'type' => 'popup',
                                'label' => __('Место', '{domain}'),
                                'template' => '{{- label }}',
                                'popup-title' => null,
                                'popup-options' => array(
                                    'show' => array(
                                        'type'  => 'checkbox',
                                        'value' => true,
                                        'label' => __('Показывать', '{domain}'),
                                    ),
                                    'label' => array(
                                        'label' => __('Заголовок поля', '{domain}'),
                                        'type' => 'text',
                                        'value' => 'Место',
                                    ),
                                    'option_2' => array(
                                        'type'  => 'addable-option',
                                        'value' => array('Аэропорт Симферополя', 'Ж/д вокзал Симферополя', 'Ай-даниль', 'Алупка', 'Алушта', 'Андреевка', 'Армянск', 'Балаклава', 'Бахчисарай', 'Белогорск', 'Береговое (ЮБК)', 'Береговое (бахчисарай)', 'Ботанический сад', 'Вилино', 'Витино', 'Гаспра', 'Геническ', 'Голубой Залив', 'Гурзуф', 'Гурзуф (Артек)', 'Даниловка', 'Джанкой', 'Евпатория', 'Заозерное', 'Зеленогорье', 'Золотое (Керчь)', 'Казантип (Поповка)', 'Канака', 'Кастрополь', 'Кацивели', 'Кача', 'Керчь', 'Керчь (героевка)', 'Керчь(порт крым)', 'Кикенеиз', 'Коктебель', 'Кореиз', 'Красные пещеры', 'Курортное (Белог. р-н)', 'Курортное (Керчь)', 'Курортное (Ленин. р-н)', 'Курортное (Феодос. р-н)', 'Курортное (Щебетовка)', 'Курпаты', 'Лавровое', 'Лазурное', 'Ласпи', 'Ленино', 'Ливадия', 'Малореченское', 'Массандра', 'Межводное', 'Меллас', 'Мирный(казантип)', 'Мисхор', 'Морское', 'Мраморные пещеры', 'Мрия резорт СКК', 'Мысовое(щелкино)', 'Научный', 'Нижнегорское', 'Нижняя Ореанда', 'Никита', 'Николаевка', 'Николаевка(Украина)', 'Новоозерное', 'Новоотрадное', 'Новофедоровка', 'Новый свет', 'Окуневка', 'Оленевка', 'Олива', 'Оползневое (Мрия Резорт))', 'Орджоникидзе', 'Орлиное', 'Орловка', 'Отрадное', 'Парковое', 'Партенит', 'Песочное (Щелкино)', 'Песчаное', 'Понизовка (СКК Мрия)', 'Поповка', 'Прибрежное (Саки)', 'Приветное', 'Раздольное', 'Рыбачье', 'Саки', 'Саки (полтава)', 'Санаторное', 'Сатера', 'Севастополь (Гагар. р-н)', 'Севастополь (Голландия)', 'Севастополь (Ленин. р-н)', 'Севастополь (Любимовка)', 'Севастополь (Радиогорка)', 'Севастополь (Учкуевка )', 'Севастополь (Фиолент)', 'Семидворье', 'Симеиз', 'Симферополь', 'Соколиное', 'Солнечная Долина', 'Солнечногорское', 'Сотера', 'Старый Крым', 'Судак', 'Угловое', 'Утёс', 'Феодосия', 'Феодосия (Приморский)', 'Феодосия(Береговое)', 'Форос', 'Фрунзе', 'Херсон (Украина)', 'Черноморское', 'Чонгар', 'Штормовое', 'Щебетовка', 'Щелкино', 'Щелкино (Азовский)', 'Ялта'),
                                        'label' => __('Города', '{domain}'),
                                        'option' => array( 'type' => 'text' ),
                                        'sortable' => true,
                                    )
                                ),
                            ),
                            'flight-number' => array(
                                'type' => 'popup',
                                'label' => __('Номер рейса', '{domain}'),
                                'template' => '{{- label }}',
                                'popup-title' => null,
                                'size' => 'small',
                                'attr'  => array( 'class' => 'custom-class', 'data-foo' => 'bar' ),
                                'popup-options' => array(
                                    'show' => array(
                                        'type'  => 'checkbox',
                                        'value' => true,
                                        'label' => __('Показывать', '{domain}'),
                                    ),
                                    'label' => array(
                                        'label' => __('Заголовок поля', '{domain}'),
                                        'type' => 'text',
                                        'value' => 'Номер рейса',
                                    )
                                ),
                            ),
                            'date' => array(
                                'type' => 'popup',
                                'label' => __('Дата', '{domain}'),
                                'template' => '{{- label }}',
                                'popup-title' => null,
                                'size' => 'small',
                                'popup-options' => array(
                                    'show' => array(
                                        'type'  => 'checkbox',
                                        'value' => true,
                                        'label' => __('Показывать', '{domain}'),
                                    ),
                                    'label' => array(
                                        'label' => __('Заголовок поля', '{domain}'),
                                        'type' => 'text',
                                        'value' => 'Дата',
                                    )
                                ),
                            ),
                            'time' => array(
                                'type' => 'popup',
                                'label' => __('Время', '{domain}'),
                                'template' => '{{- label }}',
                                'popup-title' => null,
                                'size' => 'small',
                                'popup-options' => array(
                                    'show' => array(
                                        'type'  => 'checkbox',
                                        'value' => true,
                                        'label' => __('Показывать', '{domain}'),
                                    ),
                                    'label' => array(
                                        'label' => __('Заголовок поля', '{domain}'),
                                        'type' => 'text',
                                        'value' => 'Время',
                                    )
                                ),
                            )
                        ),
                    ),
                    'order-form-section-2' => array(
                        'type' => 'box',
                        'title' => __('Куда', '{domain}'),
                        'options' => array(
                            'place' => array(
                                'type' => 'popup',
                                'label' => __('Место', '{domain}'),
                                'template' => '{{- label }}',
                                'popup-title' => null,
                                'popup-options' => array(
                                    'show' => array(
                                        'type'  => 'checkbox',
                                        'value' => true,
                                        'label' => __('Показывать', '{domain}'),
                                    ),
                                    'label' => array(
                                        'label' => __('Заголовок поля', '{domain}'),
                                        'type' => 'text',
                                        'value' => 'Город',
                                    ),
                                    'option_2' => array(
                                        'type'  => 'addable-option',
                                        'value' => array('Аэропорт Симферополя', 'Ж/д вокзал Симферополя', 'Ай-даниль', 'Алупка', 'Алушта', 'Андреевка', 'Армянск', 'Балаклава', 'Бахчисарай', 'Белогорск', 'Береговое (ЮБК)', 'Береговое (бахчисарай)', 'Ботанический сад', 'Вилино', 'Витино', 'Гаспра', 'Геническ', 'Голубой Залив', 'Гурзуф', 'Гурзуф (Артек)', 'Даниловка', 'Джанкой', 'Евпатория', 'Заозерное', 'Зеленогорье', 'Золотое (Керчь)', 'Казантип (Поповка)', 'Канака', 'Кастрополь', 'Кацивели', 'Кача', 'Керчь', 'Керчь (героевка)', 'Керчь(порт крым)', 'Кикенеиз', 'Коктебель', 'Кореиз', 'Красные пещеры', 'Курортное (Белог. р-н)', 'Курортное (Керчь)', 'Курортное (Ленин. р-н)', 'Курортное (Феодос. р-н)', 'Курортное (Щебетовка)', 'Курпаты', 'Лавровое', 'Лазурное', 'Ласпи', 'Ленино', 'Ливадия', 'Малореченское', 'Массандра', 'Межводное', 'Меллас', 'Мирный(казантип)', 'Мисхор', 'Морское', 'Мраморные пещеры', 'Мрия резорт СКК', 'Мысовое(щелкино)', 'Научный', 'Нижнегорское', 'Нижняя Ореанда', 'Никита', 'Николаевка', 'Николаевка(Украина)', 'Новоозерное', 'Новоотрадное', 'Новофедоровка', 'Новый свет', 'Окуневка', 'Оленевка', 'Олива', 'Оползневое (Мрия Резорт))', 'Орджоникидзе', 'Орлиное', 'Орловка', 'Отрадное', 'Парковое', 'Партенит', 'Песочное (Щелкино)', 'Песчаное', 'Понизовка (СКК Мрия)', 'Поповка', 'Прибрежное (Саки)', 'Приветное', 'Раздольное', 'Рыбачье', 'Саки', 'Саки (полтава)', 'Санаторное', 'Сатера', 'Севастополь (Гагар. р-н)', 'Севастополь (Голландия)', 'Севастополь (Ленин. р-н)', 'Севастополь (Любимовка)', 'Севастополь (Радиогорка)', 'Севастополь (Учкуевка )', 'Севастополь (Фиолент)', 'Семидворье', 'Симеиз', 'Симферополь', 'Соколиное', 'Солнечная Долина', 'Солнечногорское', 'Сотера', 'Старый Крым', 'Судак', 'Угловое', 'Утёс', 'Феодосия', 'Феодосия (Приморский)', 'Феодосия(Береговое)', 'Форос', 'Фрунзе', 'Херсон (Украина)', 'Черноморское', 'Чонгар', 'Штормовое', 'Щебетовка', 'Щелкино', 'Щелкино (Азовский)', 'Ялта'),
                                        'label' => __('Города', '{domain}'),
                                        'option' => array( 'type' => 'text' ),
                                        'sortable' => true,
                                    )
                                ),
                            )
                        ),
                    ),
                ),
            ),
            'settings' => array(
                'type'    => 'tab',
                'title'   => __( 'Settings', 'fw' ),
                'options' => array(
                    'settings-options' => array(
                        'title'   => __( 'Options', 'fw' ),
                        'type'    => 'tab',
                        'options' => array(
                            'form_email_settings' => array(
                                'type'    => 'group',
                                'options' => array(
                                    'email_to' => array(
                                        'type'  => 'text',
                                        'label' => __( 'Email To', 'fw' ),
                                        'help' => __( 'We recommend you to use an email that you verify often', 'fw' ),
                                        'desc'  => __( 'The form will be sent to this email address.', 'fw' ),
                                    ),
                                ),
                            ),
                            'form_text_settings'  => array(
                                'type'    => 'group',
                                'options' => array(
                                    'subject-group' => array(
                                        'type' => 'group',
                                        'options' => array(
                                            'subject_message'    => array(
                                                'type'  => 'text',
                                                'label' => __( 'Subject Message', 'fw' ),
                                                'desc' => __( 'This text will be used as subject message for the email', 'fw' ),
                                                'value' => __( 'Contact Form', 'fw' ),
                                            ),
                                        )
                                    ),
                                    'submit-button-group' => array(
                                        'type' => 'group',
                                        'options' => array(
                                            'submit_button_text' => array(
                                                'type'  => 'text',
                                                'label' => __( 'Submit Button', 'fw' ),
                                                'desc' => __( 'This text will appear in submit button', 'fw' ),
                                                'value' => __( 'Send', 'fw' ),
                                            ),
                                        )
                                    ),
                                    'success-group' => array(
                                        'type' => 'group',
                                        'options' => array(
                                            'success_message'    => array(
                                                'type'  => 'text',
                                                'label' => __( 'Success Message', 'fw' ),
                                                'desc' => __( 'This text will be displayed when the form will successfully send', 'fw' ),
                                                'value' => __( 'Message sent!', 'fw' ),
                                            ),
                                        )
                                    ),
                                    'failure_message'    => array(
                                        'type'  => 'text',
                                        'label' => __( 'Failure Message', 'fw' ),
                                        'desc' => __( 'This text will be displayed when the form will fail to be sent', 'fw' ),
                                        'value' => __( 'Oops something went wrong.', 'fw' ),
                                    ),
                                ),
                            ),
                        )
                    ),
                    'mailer-options'   => array(
                        'title'   => __( 'Mailer', 'fw' ),
                        'type'    => 'tab',
                        'options' => array(
                            'mailer' => array(
                                'label' => false,
                                'type'  => 'mailer'
                            )
                        )
                    )
                ),
            ),
        ),
    ),
);


